---
kind: property
id: P:Autodesk.Revit.DB.Connector.ConnectorManager
zh: 连接件、接口
source: html/61339b71-5d90-c53d-bec4-2209bab97787.htm
---
# Autodesk.Revit.DB.Connector.ConnectorManager Property

**中文**: 连接件、接口

The connector manager of the connector.

## Syntax (C#)
```csharp
public ConnectorManager ConnectorManager { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown on failure to get connector manager.